# coding:utf-8

# 注意： Python 中， 字符串连接， 就是简单的相加。 
# 数字转换为字符串， 则是使用 str 函数.
print('[加] 1+1 = ' + str(1+1))

print('[字符串加] "1"+"1" = ' , '1' + '1' )

print('[减] 100-64 =', (100-64))

print('[乘] 2*64 =', (2*64))

print('[幂] 3**4 = (3*3*3*3) =', (3**4))

# 这个区别于 C# 那种， 整数除整数， 结果就是整数的情况.
print('[除] 8/5 =', (8/5))

# 这个相当于 C# 那种， 整数除整数， 结果就是整数的情况.
print('[除取整] 8//5 =', (8//5))

print('[余数] 8%5 =', (8%5))

print('[左移] 2<<2 =', (2<<2))

print('[右移] 8>>2 =',  (8>>2))

print('[按位与] 5&3 =', (5&3))

print('[按位或] 5|3 =', (5|3))

print('[按位异或] 5^3 =', (5^3))

print('[按位翻转] x的按位翻转是-(x+1)  ~5 = ', str(~5))

# 返回x是否小于y。所有比较运算符返回1表示真，返回0表示假。
# 这分别与特殊的变量True和False等价。注意，这些变量名的大写。
print('[小于] 5<3 = ', (5<3))
print('[小于] 3<5 = ', (3<5))


print('[大于] 5>3 = ', (5>3))
print('[大于] 3>5 = ', (3>5))


print('[小于等于] 5<=3 = ', (5<=3))
print('[小于等于] 5<=5 = ', (5<=5))
print('[小于等于] 5<=7 = ', (5<=7))


print('[大于等于] 5>=3 = ', (5>=3))
print('[大于等于] 5>=5 = ', (5>=5))
print('[大于等于] 5>=7 = ', (5>=7))


print('[等于] 5==3 = ', (5==3))
print('[等于] 3==3 = ', (3==3))

print('[不等于] 5!=3 = ', (5!=3))
print('[不等于] 3!=3 = ', (3!=3))


print('[布尔“非”]  not(3==3) = ', (not(3==3)))
print('[布尔“非”]  not(3==5) = ', (not(3==5)))


print('[布尔“与”]  (3==3) and (5==5) = ', ((3==3) and (5==5)))
print('[布尔“与”]  (3==3) and (5==3) = ', ((3==3) and (5==3)))
print('[布尔“与”]  (5==3) and (5==3) = ', ((5==3) and (5==3)))


print('[布尔“或”]  (3==3) or (5==5) = ', ((3==3) or (5==5)))
print('[布尔“或”]  (3==3) or (5==3) = ', ((3==3) or (5==3)))
print('[布尔“或”]  (5==3) or (5==3) = ', ((5==3) or (5==3)))


